from typing import List


class TreeItem:
    id_: int
    title: str
    children: List["TreeItem"]

    def __init__(self, title: str, children: List["TreeItem"]) -> None:
        self.title = title
        self.children = children


q1_1_1_1 = TreeItem("Лисий хвост", [])
q1_1_1_2 = TreeItem("Длинный каскад", [])
q1_1_1_3 = TreeItem("Длинная лесенка", [])
q1_1_1_4 = TreeItem("Рваная стрижка", [])
q1_1_1_5 = TreeItem("Голливуд", [])
q1_1_1_6 = TreeItem("Прямой срез", [])
q1_1_1_7 = TreeItem("Шапочка на длинные волосы", [])
q1_1_1 = TreeItem(
    "Длинные волосы",
    [q1_1_1_1, q1_1_1_2, q1_1_1_3, q1_1_1_4, q1_1_1_5, q1_1_1_6, q1_1_1_7],
)

q1_1_2_1 = TreeItem("Среднее каре", [])
q1_1_2_2 = TreeItem("Каскад", [])
q1_1_2_3 = TreeItem("Лесенка", [])
q1_1_2_4 = TreeItem("Рапсодия", [])
q1_1_2_5 = TreeItem("Сессон", [])
q1_1_2 = TreeItem(
    "Волосы средней длины", [q1_1_2_1, q1_1_2_2, q1_1_2_3, q1_1_2_4, q1_1_2_5]
)

q1_1_3_1 = TreeItem("Боб каре", [])
q1_1_3_2 = TreeItem("Каре без челки", [])
q1_1_3_3 = TreeItem("Ракушка", [])
q1_1_3_4 = TreeItem("Пикси", [])
q1_1_3_5 = TreeItem("Милитари", [])
q1_1_3_6 = TreeItem("Гарсон", [])
q1_1_3 = TreeItem(
    "Короткие волосы", [q1_1_3_1, q1_1_3_2, q1_1_3_3, q1_1_3_4, q1_1_3_5, q1_1_3_6]
)


q1_1 = TreeItem("Женская прическа", [q1_1_1, q1_1_2, q1_1_3])

q1_2_1_1 = TreeItem("Мэн-бан", [])
q1_2_1 = TreeItem("Длинные волосы", [q1_2_1_1])

q1_2_1_2 = TreeItem("Маллет", [])
q1_2_2 = TreeItem("Волосы средней длины", [q1_2_1_2])

q1_2_3_1 = TreeItem("Полубокс", [])
q1_2_3_2 = TreeItem("Канадка", [])
q1_2_3_3 = TreeItem("Кроп", [])
q1_2_3_4 = TreeItem("Горшок", [])
q1_2_3_5 = TreeItem("Бокс", [])
q1_2_3_6 = TreeItem("Топ-кнот", [])
q1_2_3_7 = TreeItem("Фейд", [])
q1_2_3_8 = TreeItem("Андеркат", [])
q1_2_3_9 = TreeItem("Тэннис", [])
q1_2_3 = TreeItem(
    "Короткие волосы",
    [
        q1_2_3_1,
        q1_2_3_2,
        q1_2_3_3,
        q1_2_3_4,
        q1_2_3_5,
        q1_2_3_6,
        q1_2_3_7,
        q1_2_3_8,
        q1_2_3_9,
    ],
)

q1_2 = TreeItem("Мужская прическа", [q1_2_1, q1_2_2, q1_2_3])

q1 = TreeItem(
    "Выбор прически",
    [q1_1, q1_2],
)
